fix: profile modify
